blogs/rsa-command-basic.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>RSA 命令行和Key格式</title>
<!-- 2016-02-28 日 19:22 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="zhengzhiyong" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">RSA 命令行和Key格式</h1>
<p>
RSA的使用本身不复杂，尤其是某些语言（例如Java）接口封装的很好，只需要照文档编程就好，不需要更多的知识。但涉及到多语言操作Key时，就碰到点问题，我用的是Java和Lua，Lua是通过ffi直接调用的c的OpenSSL库，具体名称是 <a href="https://github.com/doujiang24/lua-resty-rsa">lua-resty-rsa</a>。
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Java语言内生成Key操作</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ff00;">KeyPairGenerator</span> <span style="color: #ffff00;">generator</span> = KeyPairGenerator.getInstance(<span style="color: #00ff00;">"RSA"</span>);
generator.initialize(1024, <span style="color: #00ffff; font-weight: bold;">new</span> <span style="color: #00ff00;">SecureRandom</span>());

<span style="color: #00ff00;">KeyPair</span> <span style="color: #ffff00;">pair</span> = generator.generateKeyPair();
Files.write(Paths.get(<span style="color: #00ff00;">"private.der"</span>), pair.getPrivate().getEncoded(), <span style="color: #ff00ff;">StandardOpenOption</span>.WRITE);
Files.write(Paths.get(<span style="color: #00ff00;">"public.der"</span>), pair.getPublic().getEncoded(), <span style="color: #ff00ff;">StandardOpenOption</span>.WRITE);

<span style="color: #00ff00;">PKCS8EncodedKeySpec</span> <span style="color: #ffff00;">pkcs8KeySpec</span> = <span style="color: #00ffff; font-weight: bold;">new</span> <span style="color: #00ff00;">PKCS8EncodedKeySpec</span>(Files.readAllBytes(Paths.get(<span style="color: #00ff00;">"private.der"</span>)));
<span style="color: #00ff00;">PrivateKey</span> <span style="color: #ffff00;">key</span> = KeyFactory.getInstance(<span style="color: #00ff00;">"RSA"</span>).generatePrivate(pkcs8KeySpec);

<span style="color: #00ff00;">X509EncodedKeySpec</span> <span style="color: #ffff00;">x509KeySpec</span> = <span style="color: #00ffff; font-weight: bold;">new</span> <span style="color: #00ff00;">X509EncodedKeySpec</span>(Files.readAllBytes(Paths.get(<span style="color: #00ff00;">"public.der"</span>)));
<span style="color: #00ff00;">PublicKey</span> <span style="color: #ffff00;">key</span> = KeyFactory.getInstance(<span style="color: #00ff00;">"RSA"</span>).generatePublic(x509KeySpec);
</pre>
</div>

<p>
其中PublicKey可以使用PrivateKey生成。
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 使用openssl工具生成Key</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #ff0000;"># </span><span style="color: #ff0000;">openssl genrsa -out private.pem 1024</span>
<span style="color: #ff0000;"># </span><span style="color: #ff0000;">openssl rsa -in private.pem -inform PEM -outform PEM -pubout -out public.pem</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> DER 和 PEM 格式</h2>
<div class="outline-text-2" id="text-3">
<p>
  上面的Key分别以DER和PEM格式保存，DER是二进制形式，用ASN.1编码。Java分别用PKCS#8 X509读取PrivateKey和PublicKey的DER文件。
PEM是文本形式，是DER形式做base64编码，并加上头尾（如&#x2013;&#x2014;BEGIN RSA PRIVATE KEY&#x2013;&#x2014;）生成的。
</p>

<p>
DER和PEM格式可以互相转换
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #ff0000;"># </span><span style="color: #ff0000;">openssl rsa -in private.der -inform DER -outform PEM -out private.pem</span>
<span style="color: #ff0000;"># </span><span style="color: #ff0000;">openssl rsa -in public.der -inform DER -outform PEM -pubin -out public.pem</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Lua使用上面的public.pem出的问题</h2>
<div class="outline-text-2" id="text-4">
<p>
lua无法识别上面的PublicKey，格式不对。OpenSSL支持两种PublicKey格式，对应的API是 <code>PEM_read_RSAPublicKey</code> 和 <code>PEM_read_RSA_PUBKEY</code> ，其中 <code>RSAPublicKey</code> 使用#PKCS1 RSAPublicKey结构， <code>RSA_PUBKEY</code> 使用 #PKCS1 SubjectPublicKeyInfo结构，两种结构对应的PEM内容不同。
</p>

<p>
lua使用的是 <code>RSAPublicKey</code> ，而openssl命令输出的是 <code>SubjectPublicKeyInfo</code> 结构的。现在需要输出 <code>RSAPublicKey</code> 格式的。但是OpenSSL 0.9.2（centos6默认版本）命令行不支持这一点，可以编译一个1.1.0版本的，命令如下
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #ff0000;"># </span><span style="color: #ff0000;">openssl rsa -in private.pem -inform PEM -outform PEM -RSAPublicKey_out -out public.pem</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 一点体会</h2>
<div class="outline-text-2" id="text-5">
<p>
加密系统的概念其实很多，通常不需要关心，一旦碰到问题，查资料比较困难。这个问题查了挺久，当时并没有用上面的方式解决，而是曲线救国。既然PublicKey的格式不对，那么就换一种途径生成PublicKey，把ssh使用的PublicKey格式转成RSA格式的。
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #ff0000;"># </span><span style="color: #ff0000;">ssh-keygen -y -f private.pem &gt; key.pub</span>
<span style="color: #ff0000;"># </span><span style="color: #ff0000;">ssh-keygen -f key.pub -e -m pem &gt; key.pem</span>
</pre>
</div>

<p>
这个过程并不顺利，ssh-keygen的 -m 参数是openssh 6.5以后才支持的，只能编译一个6.5以后的版本才获取这个参数的支持。其实当时如果能明白OpenSSL这两种PublicKey格式，可以直接修改Lua代码，或者使用c写一个转换工具，问题应该解决的更快些。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: zhengzhiyong</p>
<p class="date">Created: 2016-02-28 日 19:22</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
